# ---------------------------------------------
# Program by @developer_telegrams
#
#
# Version   Date        Info
# 1.0       2023    Initial Version
#
# ---------------------------------------------
QUESTIONS = {
    1: {
        'text': '🍀Пришлите следующим сообщением <b>свой номер телефона.</b>\n\nПример: +79113152214',
        'title': 'Телефон',
        'error': 'Вы прислали не корректный номер. Пожалуйста, пришлите следующим сообщением Ваш номер телефона.'
                 '\n\nПример: +79113152214',
        'filter': 'phone'
    },
    2: {
        'text': '🍀<b>Пришлите следующим сообщением Электронный адрес</b> (Email) \n\nПример dog@gmail.com',
        'title': 'Email',
        'error': 'Вы прислали не корректный электронный адрес, попробуйте ещё. \n\nПример dog@gmail.com',
        'filter': 'email'
    },
    3: {
        'text': '',
        'title': '',
        'error': '',
        'filter': ''
    },
    4: {
        'text': '',
        'title': '',
        'error': '',
        'filter': ''
    },
    5: {
        'text': '',
        'title': '',
        'error': '',
        'filter': ''
    },
    6: {
        'text': '',
        'title': '',
        'error': '',
        'filter': ''
    },
}
