# ---------------------------------------------
# Program by @developer_telegrams
#
#
# Version   Date        Info
# 1.0       2023    Initial Version
#
# ---------------------------------------------
QUESTIONS = {
    0: {
        'text': '<b>Пришлите следующим сообщением свой номер телефона.</b>\n\nПример: +79113152214',
        'error': 'Вы прислали не корректный номер. Пожалуйста, пришлите следующим сообщением Ваш номер телефона.'
                 '\n\nПример: +79113152214',
        'filter': 'phone'
    }
}
